<a href="https://colab.research.google.com/github/KamilBienias/data-science/blob/main/training/dzia%C5%82ania_na_kolumnach_df.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd

df = pd.DataFrame({
    "name": ["Kamil", "John", "Alfred"],
    "age": [21, 42, 18],
    "is_married": [True, False, True],
    "website": ["kamil-dash.pl", "john-django.com", 'alfred-spring.pl']
})

df

     name  age  is_married           website
0   Kamil   21        True     kamil-dash.pl
1    John   42       False   john-django.com
2  Alfred   18        True  alfred-spring.pl

In [5]:
# dodaje 5 do kolumny age
df["age_5_years_later"] = df["age"].apply(lambda x: x + 5)
df

     name  age  is_married           website  age_5_years_later
0   Kamil   21        True     kamil-dash.pl                 26
1    John   42       False   john-django.com                 47
2  Alfred   18        True  alfred-spring.pl                 23

In [6]:
# Jeśli żonaty to w nowej kolumnie 'years_in_marriage' wpisuje jego wiek pomniejszony o 10.
# Jeśli singiel, to wyświetli się NaN.
df["years_in_marriage"] = df["age"][df["is_married"]==True].apply(lambda x: x - 10)
# wpisanie 0 używając apply dla tych co mają False powodowało wświetlenie NaN dla pozostałych
# df["years_in_marriage"] = df["age"][df["is_married"]==False].apply(lambda x: 0)
# Zamieniam NaN na 0
df = df.fillna(value={"years_in_marriage": 0})
df

     name  age  ...  age_5_years_later years_in_marriage
0   Kamil   21  ...                 26              11.0
1    John   42  ...                 47               0.0
2  Alfred   18  ...                 23               8.0

[3 rows x 6 columns]

In [7]:
# rozdziela adres strony od domeny
new_df = df["website"].str.split(".", expand=True)
df["adres"] = new_df[0]
df["domena"] = new_df[1]
df

     name  age  is_married  ... years_in_marriage          adres  domena
0   Kamil   21        True  ...              11.0     kamil-dash      pl
1    John   42       False  ...               0.0    john-django     com
2  Alfred   18        True  ...               8.0  alfred-spring      pl

[3 rows x 8 columns]